{
    "marca": "/assets/Marca.png",
    "bitcoin": "14aAC1AfhaBVUsuZ4bshPCn5tSWWBffUZR",
    "cripto-rede": "Endereço copiado. Cole na sua corretora e selecione a Rede: Bitcoin (BTC).",
    "foto": "/assets/sobre/ryan.jpg",
    "banner": "/assets/sobre/banner.jpg",
    "categoria": "Desenvolvedor Full-Stack",
    "boas-vindas": "Sou desenvolvedor e este é o meu espaço. Sinta-se em à vontade para explorar o site e conhecer meu portfólio e descobrir como posso ajudar no seu próximo projeto.",
    "resumo": [
        "Sou desenvolvedor Web. Crio projetos organizados, focados em reutilização de códigos e facilidade de manutenção. Este portfólio reflete como penso, estruturo e entrego soluções.",
        "Meu interesse por tecnologia começou cedo, explorando computadores, sistemas e automaçãoes antes mesmo de pensar em programação. Ao longo do tempo, fui aprendendo na prática, desde organização de arquivos, edicão de mídia e automações domésticas.",
        "Essa curiosidade prática me levou ao desenvolvimento web, onde encontrei um espaço para transformar ideias em produtos funcionais usando  [https://pt.wikipedia.org/wiki/HTML|HTML], [https://pt.wikipedia.org/wiki/CSS|CSS] e [https://pt.wikipedia.org/wiki/JavaScript|JavaScript] e o ecossistema web moderno.",
        "Hoje eu desenvolvo projetos pensando em escabilidade, legibilidade e produtividade. Estruturo aplicações de forma que novas funcionalidades possam ser adicionadas como o mínimo de esforço, como neste portfólio, onde os projetos são gerenciados por dados organizados."
    ],
    "historia": [
        "Desde criança eu tinha uma curiosidade pequena em saber como o computador funcionava e nem se passava na minha mente em estudar ou me torna um desenvolvedor e afinal eu nessa época eu so ficava jogando jogos no navegador jogos [https://en.wikipedia.org/wiki/Browser_game|Flash] que existia na época que era da [https://pt.wikipedia.org/wiki/Cartoon_Network|Cartoon Network] e vendo videos no [https://pt.wikipedia.org/wiki/YouTube|YouTube].",
        "E foi passando alguns anos comecei a ver como fazer funcionar oque queria na época, era instalar jogos de celular por exemplo: [https://pt.wikipedia.org/wiki/Minecraft|Minecraft] que era pago, e mexendo varias e varias vezes eu aprendi a mexer no Gerenciador de Arquivos usando [https://pt.wikipedia.org/wiki/ES_File_Explorer|ES File Explorer] e ainda aprendi a mexer em outros arquivos como .png .jpg .gif e outros formatos, fazia alguma montagem de foto, edição de fotos familiares e figurinha no [https://pt.wikipedia.org/wiki/WhatsApp|WhastApp] e .mp4 .mkv para fazer download filmes e series no [https://pt.wikipedia.org/wiki/%CE%9CTorrent|Utorrent] pela internet ou edição de video usando [https://logo--editing-fandom-com.translate.goog/wiki/KineMaster?_x_tr_sl=en&_x_tr_tl=pt&_x_tr_hl=pt&_x_tr_pto=tc|KineMaster] e .mp3 fazer download de musica online no [https://pt.wikipedia.org/wiki/YouTube|YouTube] kkk e também fazia com jogos de videogame também no [https://pt.wikipedia.org/wiki/PlayStation_2|PlayStation 2] usando [https://consolemods.org/wiki/PS3:Open_PS2_Loader_(OPL)|OPL] e até hoje no [https://pt.wikipedia.org/wiki/PlayStation_3|PlayStation 3] e [https://pt.wikipedia.org/wiki/PlayStation_4|PlayStation 4] usando [https://www.psdevwiki.com/ps4/Homebrew_Enabler|GoldHEN].",
        "E cresci mais um pouco ai comecei a fazer automações com o [https://pt.wikipedia.org/wiki/Google_Nest|Google Nest Mini] como por exemplo automação de lâmpada pedindo o Nest para apagar as luz e comecei a me interessar na area de automação e ainda não me torna um desenvolvedor e ai tinha uns tablets antigos guardado e decidi em ressuscitar eles kkkk ai comecei a explorar mais o sobre e aprendi: Fazer [https://pt.wikipedia.org/wiki/Root_no_Android|ROOT] com [https://en.wikipedia.org/wiki/Magisk_(software)|Magisk], Mexer no Terminal e Instalar [https://en.wikipedia.org/wiki/List_of_custom_Android_distributions|Custom ROM] e ainda não me decidi em tornar um programador era so curiosidade.",
        "E um dia meu irmão me convidou para ver ser me engajava na área Web ai ele me mostrou algumas partes como: [https://pt.wikipedia.org/wiki/HTML|HTML], [https://pt.wikipedia.org/wiki/CSS|CSS] e [https://pt.wikipedia.org/wiki/JavaScript|JavaScript] e descobrir que existe grandes possibilidades de uso pro computador e aqui começou minha jornada como desenvolvedor e conforme dias foram passando comecei a gostar e entender mais na área web e não somente da área aprendi desde: instalação de [https://en-wikipedia-org.translate.goog/wiki/Windows_Boot_Manager?_x_tr_sl=en&_x_tr_tl=pt&_x_tr_hl=pt&_x_tr_pto=tc|Boot do Windows] e fazer uma [https://wiki.projetoroot.com.br/index.php/Pendrive_boot%C3%A1vel|Pendrive Bootável] usando [https://pt.wikipedia.org/wiki/Rufus_(software)|Rufus] até como fazer um servidor caseiro com [https://en.wikipedia.org/wiki/Raspberry_Pi|Raspberry PI] e minerar [https://pt.wikipedia.org/wiki/Bitcoin|Bitcoin] com [https://de.wikipedia.org/wiki/Umbrel_OS|Umbrel OS] e muitas outras coisas."
    ]
}